In [1]:
import pandas as pd
import numpy as np
import glob
%matplotlib inline

In [2]:
#Import all CSV formated time series data set in to one data frame 'df_gaming'
path = r'C:\Users\Chinthaka Asiri\Desktop\Python Jupyter\Jupyter 1\Project 9'
all_files = glob.glob(path + "/*.csv")

li = []

for filename in all_files:
    df1 = pd.read_csv(filename, index_col=None, header=0)
    li.append(df1)

df_gaming = pd.concat(li, axis=0, ignore_index=True)
df_gaming.head()

      Date  Playstation  Nintendo  Other  Xbox
0  2012-08        89.83     10.17      0   NaN
1  2012-09        90.57      9.43      0   NaN
2  2012-10        91.69      8.31      0   NaN
3  2012-11        91.27      8.73      0   NaN
4  2012-12        90.27      9.73      0   NaN

In [16]:
#Keep the original and work with a copy of data.
gamingc = df_gaming.copy()
gamingc.fillna(0,inplace=True) #Fill NAN with 0 for further analysis purposes
gamingc.head()

      Date  Playstation  Nintendo  Other  Xbox
0  2012-08        89.83     10.17      0   0.0
1  2012-09        90.57      9.43      0   0.0
2  2012-10        91.69      8.31      0   0.0
3  2012-11        91.27      8.73      0   0.0
4  2012-12        90.27      9.73      0   0.0

In [17]:
#Understand the dataframe 'gaming'
gamingc.shape

(109, 5)

In [18]:
#Identify duplicated Dates in 'Date' column
gamingc.Date.duplicated().sum()

3

In [19]:
#Remove all 3 duplicated columns
gamingc.drop_duplicates(subset='Date', inplace=True)
gamingc.shape #If the code is true, we should get (109 - 3 = 106) 106,5 as answer

(106, 5)

In [20]:
#Create Sum column and later it can be used to remove below 100% values (Below 95% will consider here)
gamingc['Sum']=gamingc.sum(axis=1)
gamingc.head()

      Date  Playstation  Nintendo  Other  Xbox    Sum
0  2012-08        89.83     10.17      0   0.0  100.0
1  2012-09        90.57      9.43      0   0.0  100.0
2  2012-10        91.69      8.31      0   0.0  100.0
3  2012-11        91.27      8.73      0   0.0  100.0
4  2012-12        90.27      9.73      0   0.0  100.0

In [21]:
#Tag rows which consist below 95% of sum with boolian
gamingc.loc[gamingc['Sum'] > 95 , 'Keep the Row'] = True
gamingc.loc[gamingc['Sum'] <=95 , 'Keep the Row'] = False
#Check how many rows has True and how many has False tagged
gamingc['Keep the Row'].value_counts()

True     99
False     7
Name: Keep the Row, dtype: int64

In [23]:
gaming = gamingc.copy() #Create a copy of DF to proceed with
gaming.head()

      Date  Playstation  Nintendo  Other  Xbox    Sum Keep the Row
0  2012-08        89.83     10.17      0   0.0  100.0         True
1  2012-09        90.57      9.43      0   0.0  100.0         True
2  2012-10        91.69      8.31      0   0.0  100.0         True
3  2012-11        91.27      8.73      0   0.0  100.0         True
4  2012-12        90.27      9.73      0   0.0  100.0         True

In [24]:
#Since there are three rows containing lessthan 10% of total, we have to remove them
filter_false = gaming['Keep the Row'] == False
gaming.drop(index=gaming[filter_false].index, inplace=True)
gaming.shape #Check wether 7 rows are missing and if yes, it should be 99,7

(99, 7)

In [26]:
#Double check whether False results have been removed or not
gaming['Keep the Row'].value_counts()

True    99
Name: Keep the Row, dtype: int64

In [27]:
#Save the cleaned dataframe as a CSV for further references
gaming.to_csv('Filtered-Data-1.csv',index=0)
game_c = gaming.copy() #Create a copy of a 'gaming' dataframe
game_c.head()

      Date  Playstation  Nintendo  Other  Xbox    Sum Keep the Row
0  2012-08        89.83     10.17      0   0.0  100.0         True
1  2012-09        90.57      9.43      0   0.0  100.0         True
2  2012-10        91.69      8.31      0   0.0  100.0         True
3  2012-11        91.27      8.73      0   0.0  100.0         True
4  2012-12        90.27      9.73      0   0.0  100.0         True

In [28]:
#Remove 'Sum' and 'Keep the Row' columns
game_c.drop(['Sum', 'Keep the Row'], axis=1, inplace= True)
game_c.head()

      Date  Playstation  Nintendo  Other  Xbox
0  2012-08        89.83     10.17      0   0.0
1  2012-09        90.57      9.43      0   0.0
2  2012-10        91.69      8.31      0   0.0
3  2012-11        91.27      8.73      0   0.0
4  2012-12        90.27      9.73      0   0.0

In [29]:
#Check the dataframe shape for final modifications
game_c.shape

(99, 5)

In [31]:
#Transpose the dataframe to match with the input dataset
game_trans=game_c.T
gc_header=game_trans.iloc[0]
game_trans=game_trans[1:]
game_trans.columns=gc_header
game_trans.head()

Date,2012-08,2012-09,2012-10,2012-11,2012-12,2013-01,2013-02,2013-03,2013-04,2013-05,...,2020-01,2020-02,2020-03,2020-04,2020-05,2020-06,2020-07,2020-08,2020-09,2020-10
Playstation,89.83,90.57,91.69,91.27,90.27,89.32,88.23,87.36,87.01,86.45,...,68.08,57.7,41.44,40.87,65.99,64.68,63.39,64.22,66.33,65.09
Nintendo,10.17,9.43,8.31,8.73,9.73,10.68,11.77,12.64,12.99,13.55,...,0.87,0.68,0.44,0.45,0.55,0.01,0.01,0.01,0.01,0
Other,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Xbox,0,0,0,0,0,0,0,0,0,0,...,31.04,41.62,58.12,58.68,33.46,35.32,36.6,35.77,33.66,34.9

In [32]:
#Save final formated dataframe into CSV file for data visualization 
game_trans.to_csv('Filtered-Data-T.csv')